const imgBaseUrl = "images/activities";

export default {
  datas: [
    {
      title: "D & D 1기 활동",
      img: imgBaseUrl + "/DnD.png",
      detail:
        "서울에서 진행하는 엔젤 핵 해커톤에 참여하였습니다. 학교 과제가 아닌 마음 맞는 친구들과 자의로 진행한 프로젝트면서 참가한 대회 중 규모가 가장 큰 대회였습니다. 프로젝트를 진행하면서 순탄치만은 않았고, 서로의 의견차이로 인해 마찰도 겪었던 대회였습니다. 수상은 하지 못했으나, 대회가 끝난 후 서로 오해를 풀고 프로젝트를 계속해서 진행하여 '아이언 멘탈'이라는 서비스를 런칭하였습니다. 프로젝트 진행을 하면서 소통의 중요성을 깨달았던 계기가 되었고, 동시에 처음으로 협업을 통해 서비스를 실제 런칭한 경험이었습니다.",
      date: "2019 May 31th",
      alt: "앤젤 핵 로고"
    },
    {
      title: "엔젤 핵 해커톤 참여",
      img: imgBaseUrl + "/angelhack.jpg",
      detail:
        "서울에서 진행하는 엔젤 핵 해커톤에 참여하였습니다. 학교 과제가 아닌 마음 맞는 친구들과 자의로 진행한 프로젝트면서 참가한 대회 중 규모가 가장 큰 대회였습니다. 프로젝트를 진행하면서 순탄치만은 않았고, 서로의 의견차이로 인해 마찰도 겪었던 대회였습니다. 수상은 하지 못했으나, 대회가 끝난 후 서로 오해를 풀고 프로젝트를 계속해서 진행하여 '아이언 멘탈'이라는 서비스를 런칭하였습니다. 프로젝트 진행을 하면서 소통의 중요성을 깨달았던 계기가 되었고, 동시에 처음으로 협업을 통해 서비스를 실제 런칭한 경험이었습니다.",
      date: "2019 May 31th",
      alt: "앤젤 핵 로고"
    },
    {
      title: "SOLAB 외주 프로젝트",
      img: null,
      detail:
        "친구 친척의 제안으로 영상처리 관련 프로그램 외주 프로젝트를 진행하였습니다. 대학생 신분으로 개발회사에서 외주를 받을 기회가 흔치 않을 것 같아 하겠다고 하였습니다. 진행을 하면서 테스트, 문서화 등 개발이외에도 고려해야할 사항들이 많다는 것을 알게되었고, 만들고 싶은 프로젝트를 만드는 것과 만들어야만 하는 프로젝트의 차이점 등 현실적인 부분에서도 많은 것을 느꼈던 소중한 경험이었습니다.",
      date: "2019 March 8th",
      alt: null
    },
    {
      title: "구글 클라우드, 머신러닝 스터디 잼",
      img: imgBaseUrl + "/google_studyjam.jpeg",
      detail:
        "이전에 스터디를 같이 했던 분들과 함께 클라우드, 머신러닝 스터디 잼에 참여하였습니다.",
      date: "2019 January 8th",
      alt: "구글 스터디잼 로고"
    },
    {
      title: "부스트 에이스 2기 활동",
      img: imgBaseUrl + "/boostace.png",
      detail:
        "네이버 커넥트 재단의 부스트코스 웹프로그래밍 과정을 이수하였습니다. 이때 웹개발을 처음 입문하게 되었고, 진로를 결정하게 된 계기가 되었습니다. 6개의 프로젝트를 진행하면서 어려운 문제점에 많이 부딫히고, 이를 해결하기 위해 몇 주를 고민한 적도 있습니다. 서울에서는 QnA 데이라고 하는 현업자에게 질문을 할 수 있는 기회가 주어졌었는데, 기차표를 끊어 서울로 올라가 질문을 하고 내려왔던 경험도 있습니다. 아직 교육 시스템이 실험단계였던 지라, 아쉬운 점도 많았지만 스스로 무언가 처음으로 완성시켰던 경험은 저에겐 정말 값진 경험이었습니다.",
      date: "2018 May 19th",
      alt: "부스트 에이스 사진"
    },
    {
      title: "부산진 고등학교 프로그래밍 교육봉사",
      img: imgBaseUrl + "/programming_school.jpeg",
      detail:
        "부산진 고등학교에서 프로그래밍 교육 보조교사로 봉사활동을 하였습니다. 아이들을 가르치는 일이었지만, 지식을 전달하면서 나 스스로가 더 정확한 이해와 개념확립이 중요한 것을 알게되었으며 휴일에 수업을 들으러 오는 학생들을 보며 배운점도 많았던 활동이었습니다.",
      date: "2018 March 4th",
      alt: "프로그래밍 교육봉사 사진"
    },
    {
      title: "CS 연구실 활동",
      img: null,
      detail:
        "부산진 고등학교에서 프로그래밍 교육 보조교사로 봉사활동을 하였습니다. 아이들을 가르치는 일이었지만, 지식을 전달하면서 나 스스로가 더 정확한 이해와 개념확립이 중요한 것을 알게되었으며 휴일에 수업을 들으러 오는 학생들을 보며 배운점도 많았던 활동이었습니다.",
      date: "2018 March 3rd",
      alt: null
    }
  ]
};
